Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་། མངོན་པར་འཚལ་བ་མངོན་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་དགུང་ཟླ་གསུམ་བདག་གི་གནས་མ་དྲོས་པར་བཞུགས་པར་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བར་མཛད་དུ་གསོལ།
en: Full of joy and happiness, he said, “Will the Blessed One please accept my invitation to the Thus-Gone One, and to his assembly of monks and his clairvoyant bodhisattva great beings, to stay at my home, Lake Anavatapta, for three months?

source: བདག་གིས་རྔོ་ཅི་ཐོགས་སུ་ཀུན་ཏུ་སྤྱོད་པས་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་འཚལ་ལོ། །
en: I wish to serve the Blessed One to the best of my ability.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why?

source: བཅོམ་ལྡན་འདས་གང་བདག་གིས་འདི་ལྟ་བུའི་ཆོས་ཐོས་པ་ནི་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་སླར་བགྱི་བའི་རྔོ་མི་ཐོགས་སོ། །
en: Because, Blessed One, I cannot repay the Thus-Gone One for the Dharma I have heard from him, yet I pray that through my offerings to the Thus-Gone One I may never be separated from this Dharma teaching in the future.

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དེས་བདག་སླད་ཀྱིས་ཀྱང་འདི་འདྲ་བའི་ཆོས་ཐོས་པ་དང་འབྲལ་བར་མི་འགྱུར་བར་བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་གནང་བར་མཛད་དུ་གསོལ།
en: Blessed One, please accept this invitation out of kindness for me!”

source: དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་མ་གནང་ངོ་། །
en: The Blessed One declined.

source: ཟླ་བ་གཉིས་གསོལ་ཏེ།
en: “For just two months?”

source: ཡང་དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་མ་གནང་ངོ་། །
en: The Blessed One again declined.

source: ཟླ་བ་ཕྱེད་གསོལ་པ་དང་།
en: “For just half a month?”

source: ཐུགས་བརྩེ་བའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་ཅང་མི་གསུང་བས་གནང་བ་མཛད་དོ། །
en: At that point, out of kindness, the Blessed One signaled his acceptance by remaining silent.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: The nāga king Anavatapta understood by his silence that the Blessed One had agreed. He was satisfied, pleased, delighted, and joyous.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་གཉེན་དང་འཁོར་དུ་བཅས་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ནས།
en: Full of joy and happiness, he bowed to the feet of the Blessed One along with his relatives and retinue.

source: བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་སོང་སྟེ་སྤྲིན་བསྡུས་འབྲུག་བསྒྲགས་ནས་འཛམ་བུའི་གླིང་དུ་ཆར་པའི་རྒྱུན་མངོན་པར་ཕབ་སྟེ་རང་གི་གནས་སུ་ཕྱིན་ཏོ། །དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་བུ་ཐུ་བོ་ལེགས་སྦྱིན་ཞེས་བྱ་བ་ལ་བོས་ནས། ལེགས་སྦྱིན་དང་། ལེགས་གནས་དང་། ཞི་བ་ལྡན་དང་། དབང་པོ་ཞི་དང་། རྣམ་པར་འཕྲུལ་དང་། གཟི་བརྗིད་ཆེ་དང་། གཟི་བརྗིད་དཔག་མེད་དང་། དཔག་མེད་འཛིན་དང་།
en: As he left the Blessed One and returned to his homeland, clouds gathered in the sky, thunder cracked all around, and a torrent of rain fell in Jambudvīpa.

source: ཡོན་ཏན་དཔག་མེད་འཛིན་དང་། ཀུན་ནས་ཁ་དོག་དང་། གཟི་བརྗིད་མཆོག་དང་། ནོར་མི་ཟད་དང་། བཟོད་ལྡན་ལ་སོགས་པ་བུ་ལྔ་བརྒྱ་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཐམས་ཅད་ལ་བསྒོ་བ།
en: When he arrived at his home, the nāga king Anavatapta summoned his eldest son, Sudatta, and gave instructions to his five hundred sons who were followers the Great Vehicle—Sudatta, Susthita, Peaceful, Peaceful Faculties, Vikurvāṇa, Great Splendor, Boundless Splendor, Possessor of Boundlessness, Possessor of Boundless Qualities, Colorful, Supreme Splendor, Inexhaustible Wealth, Patient One, and others.

source: གཞོན་ནུ་ཁྱོད་ཤེས་པར་གྱིས་ཤིག །
en: “Listen, my sons.

source: ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་གི་དགེ་འདུན་དང་། མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་ཐབས་ཅིག་ཏུ་ཟླ་བ་ཕྱེད་སྤྱན་དྲངས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁོ་བོ་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་གནང་ངོ་། །
en: I have invited the Thus-Gone One, along with his assembly of monks and his clairvoyant bodhisattva great beings, to stay here for half a month.

source: དེ་ལ་ཁྱེད་ཐམས་ཅད་ལྷན་ཅིག་འདུས་ལ་ཀླུའི་རྩེ་བ་དང་།
en: Out of kindness for me, the Blessed One has accepted.

source: ཀླུའི་དགའ་བ་དང་།
en: You must therefore stop meeting to indulge in games, frivolities, and displays of physical prowess.

source: ཀླུའི་དབྱིབས་སྤོངས་ཤིག །འདོད་པ་ལ་རྩེ་བ་དང་། གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་།
en: You must abandon your lustful frolics and your attachment to forms, sounds, smells, tastes, and tactile objects.

source: རོ་དང་། རེག་པ་ལ་མངོན་པར་ཆགས་པ་སྤོངས་ལ་དེ་བཞིན་གཤེགས་པ་མཆོད་པ་ལ་རབ་ཏུ་འདུན་པར་བྱའོ། །དྲན་པ་དང་། ཤེས་བཞིན་དང་། བག་ཡོད་པ་ལ་གནས་པར་གྱིས་ལ་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་གྱིས་ཤིག །
en: Instead, you must aspire to worship the Thus-Gone One, and you must serve the Blessed One with constant mindfulness, alertness, and heedfulness.

source: བཅོམ་ལྡན་འདས་དེ་ནི་བག་མངའ་བའོ། །འཁོར་ཀྱང་བག་ཡོད་པའོ། །ཅང་མཁྱེན་པའོ། །འཁོར་ཀྱང་ཅང་ཤེས་པའོ། །ཞི་བའོ། །འཁོར་ཀྱང་ཞི་བའོ། །
en: Because the Blessed One is heedful, and so are those in his entourage; he is omniscient, and so are those in his entourage; he is at peace, and so are those in his entourage; and he is disciplined, and so are those in his entourage.

source: དུལ་བའོ། །འཁོར་ཀྱང་དུལ་བའོ། །དེ་ལ་ཁྱེད་ཟླ་བ་ཕྱེད་ཀྱི་བར་དུ་ཆུང་མའི་འཁོར་གྱི་ནང་དུ་མ་འཇུག་ཤིག་འདོད་པའི་རྣམ་པར་རྟོག་པ་མི་སྐྱེད་ཅིང་རྣམ་པར་རྟོག་པར་མི་བྱའོ། །གནོད་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་མི་སྐྱེད་ཅིང་རྣམ་པར་རྟོག་པར་མི་བྱའོ། །འཚེ་བའི་རྣམ་པར་རྟོག་པ་མི་སྐྱེད་ཅིང་རྣམ་པར་རྟོག་པར་མི་བྱའོ། །
en: Therefore, for half a month you must not enter your wives’ quarters; you must neither have nor entertain lustful thoughts; you must neither have nor entertain malicious thoughts; and you must neither have nor entertain harmful thoughts.

source: གཞན་ཡང་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཉན་པ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: Gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans will also come to listen to the Blessed One teach the Dharma.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དག་ཀྱང་འོང་གིས། དེ་ལ་ཁྱེད་ཀྱིས་ཇི་ལྟར་ཁོ་བོ་སྨ་བབ་པར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་གནས་དང་བཀོད་པ་སྟོན་ཅིག །
en: You must behave and comport yourselves in such a way as not to disrespect them, just as you would not disrespect me.

source: དེ་ལྟར་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་ན་འཁོར་ཡི་རངས་པར་འགྱུར་རོ། །
en: If you worship the Blessed One in this way, his entourage will be delighted.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་ནང་མི་རྣམས་ལ་བསྒོ་ནས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་གངས་ཀྱི་རིའི་རྒྱལ་པོ་དང་མཚོ་ཆེན་པོ་མ་དྲོས་པ་གཉིས་ཀྱི་བར་དུ་འཁོར་གྱི་ཁྱམས་མཐའ་དཔག་ཚད་བདུན་བརྒྱ་པ་བཻ་དཱུརྱ་སྔོན་པོ་དག་པ་དང་། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱིས་སྤྲས་པ་རྡོ་རྗེ་སྣ་ཚོགས་རྣམ་པར་བཀྲ་བ་མངོན་པར་སྤྲུལ་ཏོ། །
en: Having instructed his family members in this way, the nāga king Anavatapta, so as to worship to the Blessed One, conjured a variety of shining vajras ornamented with blue beryl and Jambu River gold and spread across an area seven hundred leagues wide between the king of snow mountains and the great lake Anavatapta.

source: འཁོར་གྱི་ཁྱམས་དེར་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་པ། མེ་ཏོག་དང་། འབྲས་བུ་ཐམས་ཅད་དང་ལྡན་པ་དག་སྤྲུལ་ཏོ། །
en: In the same area, he conjured eighty-four thousand precious trees each adorned with all kinds of precious gems and replete with all kinds of flowers and fruits.

source: རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་རེ་རེ་ལ་ཡང་ལོ་མ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་པ། མུ་ཏིག་དམར་པོའི་དོ་ཤལ་དཔྱངས་པ་སྟོང་སྟོང་སྤྲུལ་ཏོ། །
en: On each of those eighty-four thousand precious trees, replete with all kinds of precious leaves, he conjured a thousand pink pearl necklaces.

source: འཁོར་གྱི་ཁྱམས་དེར་ཁང་བཟངས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་པ། གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: In the surrounding area, he conjured mansions lavishly decorated with all sorts of precious things, with thousands of raised parasols, banners, and flags.

source: བ་དན་བསྒྲེང་བ་སྟོང་སྤྲུལ་ཏེ། ཁང་བཟངས་དེ་དག་ཐམས་ཅད་དུ་ཡང་སེང་གེའི་ཁྲི་ལྷའི་རས་བཅོས་མ་ཟུང་བྱེ་བ་ཕྲག་དུ་མ་བཏིང་བ་རྩ་བ་གསེར་ལ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་བཞག་གོ། །
en: And in those mansions were eighty-four thousand lion thrones draped with millions of divine fabrics, their golden bases studded with all kinds of precious gems.

source: ཁང་བཟངས་ཐམས་ཅད་དུ་ཡང་ཀླུའི་བུ་མོ་སྟོང་སྟོང་བཀོད་དེ། ཐམས་ཅད་ཀྱང་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཐོགས་པ་ཤ་སྟག་གོ། །སྟེང་གི་བར་སྣང་ཡང་རིན་པོ་ཆེའི་དྲ་བའི་གདུགས་ཀྱིས་མངོན་པར་ཁེབས་པར་བྱས་སོ། །རིན་པོ་ཆེའི་དྲ་བའི་གདུགས་ཐམས་ཅད་ལས་ཀྱང་ཁ་དོག་དུ་མ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་གོས་དང་།
en: And in every mansion were thousands upon thousands of nāga maidens, each bearing flowers, incense, perfumes, garlands, ointments, powders, fabrics, parasols, banners, and flags.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཕལ་པོ་ཆེ་བརྒྱད་སྟོང་མངོན་པར་དཔྱངས་སོ། །བ་དན་ཐམས་ཅད་ལ་ཡང་རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་བརྒྱུས་ཏེ། དེ་དག་རླུང་གིས་བསྐྱོད་ན་སྙན་པ་ཡིད་དུ་འོང་བའི་སྒྲ་འབྱུང་ངོ་། །
en: The sky above the mansions was covered with jeweled canopies, from which hung eight thousand multicolored fabrics, parasols, banners, and flags, each flag threaded with strings of small jeweled bells that rang with sweet and pleasing notes when stirred by the wind.

source: ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པ་ཡང་བཤམས་སོ། །དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འདི་ལྟ་བུའི་བཀོད་པ་འདི་དག་བྱས་ནས་དེའི་ནུབ་མོ་འདས་པ་དང་།
en: Finally, he prepared delicacies rich with a hundred flavors.

source: ཉེ་དུ་དང་། འཁོར་དུ་བཅས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་དུས་སྦྲོན་ཅིང་བསྐུལ་བའི་ཕྱིར་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། ཡེ་ཤེས་འབྱུང་གནས་ཡེ་ཤེས་འབྱོར་པའི་མཛོད། །ཡེ་ཤེས་མཐའ་ཡས་མཁྱེན་པ་ཁྱོད་ལ་གསོལ། །
en: The day after the nāga king Anavatapta had finished making these arrangements, he gathered his relatives and retinue together and, with palms pressed together, offered the following verses to invite and exhort the Blessed One: “Source of wisdom, treasury of wisdom, Wise one with infinite wisdom, to you I pray.

source: ཡེ་ཤེས་ཆེ་བ་གང་དུའང་ཆགས་མི་མངའ། །ཡེ་ཤེས་སྟོབས་མཆོག་མངའ་བ་གཤེགས་སུ་གསོལ། །
en: While free of attachment to your great wisdom, You master the supreme power of that wisdom—please come to us!

source: ཕྱོགས་བཅུའི་སྲོག་ཆགས་མང་པོ་ཐམས་ཅད་ཀྱི། །སེམས་ཀྱི་སྤྱོད་པ་མཁྱེན་པའི་ཐུབ་ཆེན་པོ། །
en: “Great sage, you know the mental activities Of all the manifold creatures in the ten directions.

source: བདག་གིས་གང་ཟག་མཆོག་ནི་སྤྱན་དྲངས་པ། །
en: Best of beings, may I invite you.

source: དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ལ་བདག་དུས་སྐུལ། །
en: Great sage, may I exhort you to come now!

source: བཞེད་ཉུང་ཆོག་མཁྱེན་གསོ་སླ་དགང་སླ་བ། །ཤིན་ཏུ་མཁྱེན་ཅིང་སྡུག་བསྔལ་རྣམས་ལས་འགྲོལ། །དོན་མེད་མི་གསུང་སྤྱོད་པའི་ཆོ་ག་མཁྱེན། །བཅོམ་ལྡན་ཕུང་པོ་མི་མངའ་དུས་འདི་ལགས། །
en: “With few desires, content, easily satisfied, and easily fulfilled, Supremely wise, and free from affliction, You who never speak without meaning, you who know the proper conduct— Blessed One devoid of aggregates, it is time for you to come!

source: ཀུན་དུ་གྲགས་པ་ཡོན་ཏན་ཡེ་ཤེས་འཕགས། །
en: “Renowned by all, your qualities and wisdom are sublime.

source: མ་བསྐུལ་རྟག་ཏུ་བྱམས་ཐུགས་བཤེས་གཉེན་མཛད། །
en: Without being asked, you always act as a kind and compassionate spiritual friend.

source: ཐུབ་པ་དག་ཅིང་རྣམ་དག་ནམ་མཁའ་བཞིན། །
en: Great sage, you are immaculate and perfectly pure like the sky.

source: འདྲེན་པ་བཤོས་སྦྱར་ལགས་ཏེ་དུས་འདི་ལགས། །
en: Great guide, the food is prepared; it is time for you to come!

source: བསྙེངས་པ་མི་མངའ་སྟོབས་བཅུ་ཤུགས་མངའ་བ། །བཅྭ་བརྒྱད་སངས་རྒྱས་ཆོས་རྣམས་རབ་ཏུ་རྫོགས། །
en: “Fearless and possessing the strength of the ten powers, You have perfected the eighteen unique qualities of a buddha.

source: སྤྱི་གཙུག་བལྟར་མི་གདའ་བ་ཐུགས་རྗེ་འཕགས། །
en: The crown of your head cannot be seen, and your compassion is lofty.

source: མགོན་པོ་ཚོགས་དང་ཐབས་ཅིག་གཤེགས་སུ་གསོལ། །
en: Protector, please come to us with your assembly!

source: གཟུགས་ནི་གཟུགས་མཆོག་མཚན་གྱིས་ཤིན་ཏུ་བརྒྱན། །སྐུ་ནི་དཔེ་བྱད་བཟང་པོས་མཛེས་པར་སྤྲས། །ཕན་པའི་ཆོས་སྟོན་མཆོག་ཏུ་དགའ་མཛད་པ། །
en: “Your form is arrayed with the supreme physical marks, Your body is beautifully adorned with the minor marks, You teach the beneficial Dharma and bring supreme joy to beings.

source: བཅོམ་ལྡན་ཐུབ་ཆེན་དུས་དེ་འདི་ལགས་སོ། །
en: Blessed One, great sage, it is time for you to come!

source: ཚངས་པའི་དབྱངས་དང་དབྱངས་སྙན་འཇམ་པའི་དབྱངས། །ཀ་ལ་པིང་ཀ་འཇམ་དབྱངས་སེང་གེ་གནོན། །
en: “Your voice is delightful and sweet Like the voice of Brahmā and the songs of kalaviṅka birds.

source: ཐམས་ཅད་དབྱངས་མཆོག་སྲིད་འཁོད་ཚིམ་མཛད་པ། །
en: Its supreme melodies tame lions and bring satisfaction to the world.

source: བདག་ལ་དགའ་མཛད་གཟིགས་ཤིང་གཤེགས་སུ་གསོལ། །
en: Please make us happy, gaze upon us, and come to this place!

source: སངས་རྒྱས་ཞིང་འདིར་དེ་བཞིན་གཤེགས་ཀྱི་ཐུགས། །འཚལ་བ་སེམས་ཅན་གང་ཡང་མ་མཆིས་ཏེ། །
en: “No one in this buddha field understands The mind of the Thus-Gone One.

source: བཅོམ་ལྡན་འདས་ནི་ཀུན་གྱི་སྤྱོད་པ་མཁྱེན། །རྟག་ཏུ་དུས་སྤྱོད་དུས་དེ་འདི་ལགས་སོ། །
en: Blessed One who knows the mental activity of all beings, Who always acts at the right time, it is time for you to come!

source: འདི་ན་ལྷ་དང་མི་དང་ཀླུ་དག་མང་སྐོམ་ན། །
en: “There are many gods, humans, and nāgas who are thirsty here.

source: སྟོབས་བཅུའི་སྟོབས་མངའ་ཕ་རོལ་དཔུང་རྣམས་འཇོམས་པ་པོ། །ཐུབ་ཆེན་ཐུགས་མཆོག་ལོག་པའི་ལམ་རྣམས་རྣམ་པར་འཇིག །དྲན་རྟོགས་བློ་གྲོས་ལྡན་འདིར་རྟོགས་དང་བློ་གྲོས་མཛོད། །
en: Holder of the ten powers who subdues opposing armies, Great sage who destroys wrong paths through supreme compassion, Mindful, understanding, and intelligent, please apply your intelligence and understanding here!

source: ངན་པའི་ཚོགས་ཅན་ཚོགས་འཇོམས་ཁྲེལ་མངའ་དཔལ་མོས་དགྱེས། །ཕན་པ་མཛད་ཅིང་བདེ་མཛད་ཡོན་ཏན་བརྒྱས་གཏམས་པ། །
en: “Pleased by the glorious one who subdues wicked assemblies and metes out punishment, You bring benefit and happiness to beings; you are filled with a hundred qualities.

source: ཐུགས་རྗེ་རབ་ཏུ་བསྐྱེད་ནས་ཀླུ་བརྒྱ་རྣམ་འདུལ་ཞིང་། །
en: The compassion you generate will tame hundreds of nāgas.

source: མཚུངས་པ་མེད་པའི་མི་མཆོག་འདིར་ནི་གཤེགས་སུ་གསོལ། །
en: Peerless being, supreme human, please come to this place!

source: ཕན་བློ་ཐུགས་བརྩེ་ལྡན་ཞིང་འགྲོ་ལ་ཕན་དགྱེས་པ། །
en: “Compassionate and altruistic, you delight in benefiting beings.

source: ཇི་ལྟར་འགྲོ་བ་ཕ་རོལ་སྤྱོད་འབྱེད་བློ་གྲོས་ཅན། །སྟོབས་བཅུའི་སྤྱོད་པ་རྣམ་པར་འབྱེད་པ་རབ་གསུང་བ། །
en: With perceptiveness about how others behave, Your speech is informed by the ten powers you have mastered.

source: དྲན་རྟོགས་བློ་གྲོས་ལྡན་འདིར་རྟོགས་དང་བློ་གྲོས་མཛོད། །
en: You are mindful, understanding, and intelligent; please apply your intelligence and understanding here!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་དུས་བསྐུལ་བར་མཁྱེན་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་དུས་བསྐུལ་གྱིས་གནས་དེར་ཟླ་བ་ཕྱེད་གནས་པ་ལྟར་གཙུག་ལག་ཁང་སྐྱོང་སྐོས་ལ་ཆོས་གོས་དང་། ལྷུང་བཟེད་ཐོགས་ཞེས་བསྒོ་ཤིག །
en: Aware of the invitation of the nāga king Anavatapta, the Blessed One said to his monks, “Monks, in keeping with the invitation of the nāga king Anavatapta, we will stay in his kingdom for half a month, so appoint a caretaker for the monastery and take up your Dharma robes and alms bowls!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བདུན་ཁྲི་ཉིས་སྟོང་དང་། རྫུ་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བའི་ཉན་ཐོས་ཉིས་སྟོང་གིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས། བྱ་རྒོད་ཕུང་པོའི་རི་ལས་རྫུ་འཕྲུལ་གྱིས་གཤེགས་སོ། །
en: Surrounded and escorted by seventy-two thousand bodhisattvas and two thousand hearers with great powers and miraculous abilities, the Blessed One miraculously left Vulture Peak Mountain.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ནམ་མཁའི་ངོས་ལ་གཤེགས་ནས། འོད་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་གསལ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་འོད་སྐུ་ལས་ཕྱུང་བས་འདོད་པ་ན་སྤྱོད་པ་དང་།
en: As he flew through the sky, light streamed from the Blessed One’s body and illuminated this entire great trichiliocosm.

source: གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་དག་གིས་བཅོམ་ལྡན་འདས་ཚོགས་ཆེན་པོས་བསྐོར་ཅིང་ནམ་མཁའི་ངོས་ལས་མཚོ་ཆེན་པོ་མ་དྲོས་པར་གཤེགས་པ་མཐོང་ནས་དེ་དག་འདི་སྙམ་དུ། བཅོམ་ལྡན་འདས་འདི་ལྟ་བུའི་ཚོགས་ཀྱིས་བསྐོར་ཏེ་ཟླ་བ་ཕྱེད་གང་ན་བཞུགས་པ་དེར་ཆོས་སྟོན་དུ་ངེས་སོ་སྙམ་དུ་སེམས་སོ། །
en: By that light, the gods of the desire realm and the form realms could see the Blessed One surrounded by his great retinue, traveling through the sky toward the great lake Anavatapta, and they thought, “With such a retinue, the Blessed One is surely going to teach the Dharma there, where he will stay for half a month.”

source: དེ་ན་ལྷའི་བུ་བརྒྱ་སྟོང་མང་པོ་ཕྱི་བཞིན་འབྲང་སྟེ།
en: And so, hundreds of thousands of gods followed the Blessed One.

source: གང་དག་བཅོམ་ལྡན་འདས་ལ་བལྟ་བར་འདོད་པ་དང་། གང་དག་ཆོས་ཉན་པར་འདོད་པ་དང་། གང་དག་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་གནས་དང་། བཀོད་པ་བལྟ་བར་འདོད་པ་དེ་དག་བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་བཞིན་དོང་ངོ་། །
en: All who wished to see the Blessed One, to hear the Dharma, and to see the residence and the arrangements prepared by the nāga king Anavatapta also followed along.

source: དེ་ལ་ལྷའི་བུ་ཁ་ཅིག་ནི་ལྷའི་མེ་ཏོག་གི་ཆར་མངོན་པར་འབེབས་ཤིང་བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་བཞིན་དོང་ངོ་། །
en: As they set out after the Blessed One, some gods brought down rains of divine flowers.

source: ལྷའི་བུ་ཁ་ཅིག་ནི་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཕྱེ་མའི་ཆར་མངོན་པར་འབེབས་ཤིང་བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་བཞིན་དོང་ངོ་། །
en: As they set out after the Blessed One, some gods brought down rains of uragasāra sandalwood powder.

source: ལྷའི་བུ་ཁ་ཅིག་ནི་སིལ་སྙན་དང་གླུ་དབྱངས་ལེན་ཅིང་བཅོམ་ལྡན་འདས་ཀྱི་བསྔགས་པ་བརྗོད་དེ། བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་བཞིན་དོང་ངོ་། །
en: As they set out after the Blessed One, some gods played instruments, sang songs, and proclaimed his praises.

source: ལྷའི་བུ་ཁ་ཅིག་ནི་རང་གི་ལུས་ཀྱི་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྒྲེང་བའི་ཆར་འབེབས་ཤིང་བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་བཞིན་དོང་ངོ་། །
en: As they set out after the Blessed One, some gods raised silk streamers, parasols, banners, and flags and caused rain to fall.

source: གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དག་ནི་ཉི་མ་དང་། ཟླ་བ་དང་། རྒྱུ་སྐར་དང་། སྐར་མ་ཟིལ་དུ་རླག་པར་བྱེད་པའི་ལྷའི་འོད་ཁ་དོག་བཟང་པོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པའི་ལུས་ཀྱིས་བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་བཞིན་དོང་ངོ་། །བརྒྱ་བྱིན་དང་།
en: The gods of the pure abodes followed the Blessed One with their peaceful bodies radiating magnificent, colorful, divine light that outshone even the sun, the moon, the planets, and the stars.

source: ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་རྣམས་ཀྱང་རང་རང་གི་བཀོད་པ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་གཤེགས་པའི་རྗེས་བཞིན་དོང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: Śakra, Brahmā, and the protectors of the world also followed the Blessed One with their respective arrays.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཆེན་པོའི་ཚོགས་དུ་མས་བསྐོར་ནས་གངས་རིའི་རྒྱལ་པོའི་ལྷོ་ཕྱོགས་ཀྱི་ངོས་ལ་བཞུགས་སོ། །
en: Surrounded by diverse groups of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, bodhisattvas, and great hearers, the Blessed One came to rest on the southern slope of the king of snow mountains.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །མཽད་གལ་གྱི་བུ་ཁྱོད་སོང་སྟེ། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་དེ་བཞིན་གཤེགས་པ་བྱོན་ན་ཅི་དུས་ལ་བབ་བམ་ཞེས་སྦྲོན་ཅིག །
en: There he said to Venerable Mahāmaudgalyāyana, “Maudgalyāyana, go and ask the nāga king Anavatapta if it is time for the Thus-Gone One to arrive.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དེའི་ཚེ་ཤིང་ཏ་ལ་བདུན་སྲིད་དུ་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ནས་བྱའི་རྒྱལ་པོ་ནམ་མཁའ་ལྡིང་གི་གཟུགས་སུ་རང་གི་ལུས་བྱིན་གྱིས་བརླབས་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་གནས་ལ་བལྟས་སོ། །
en: At that moment, Venerable Mahāmaudgalyāyana rose into the sky to the height of seven palm trees. Transforming his body into that of a garuḍa, the king of birds, he surveyed the realm of the nāga king Anavatapta.

source: དེ་ནས་མ་དྲོས་པ་ན་གནས་པའི་ཀླུ་དང་ཀླུའི་བུ་མོ་དངངས་སྐྲག་སྟེ་སྤུ་ཟིང་ཞེས་བྱེད་ནས། ཕྱོགས་ཕྱོགས་སུ་རབ་ཏུ་འབྲོས་ཤིང་འདི་སྐད་ཅེས་གང་གནས་འདིར་ནམ་མཁའ་ལྡིང་རྒྱུ་བ་དེ་དག་ཐམས་ཅད་གང་ནས་འོངས་ཞེས་འཛེར་ཏོ། །
en: The nāgas and female nāgas who lived in Lake Anavatapta were terrified, and with their hairs standing on end, they fled in all directions exclaiming, “Where have all those roaming garuḍas come from?”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་ལག་པ་གཡས་པས་ཀླུ་དང་ཀླུའི་བུ་མོ་དེ་དག་ལ་མ་འཇིགས་མ་འཇིགས།
en: Raising his right hand, the nāga king Anavatapta calmed them. He comforted and reassured those nāgas and female nāgas, saying, “Do not be afraid! Do not be afraid!

source: འདི་ནི་བཙུན་པ་མཽད་གལ་གྱི་བུས་རྫུ་འཕྲུལ་རྣམ་པར་སྤྲུལ་པའོ། །ཞེས་དབུགས་འབྱིན་ཅིང་འཇོག །
en: These are manifestations of Venerable Maudgalyāyana!”

source: འགོད་རབ་ཏུ་འགོད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བསྐུལ་ནས་སོང་ངོ་། །
en: After Venerable Mahāmaudgalyāyana had presented his message, he left.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་བུ་དང་བཅས། ཆུང་མ་དང་བཅས། གཉེན་དང་འཁོར་དུ་བཅས་ཏེ་མེ་ཏོག་ཐམས་ཅད་དང་། ཕྱེ་མ་ཐམས་ཅད་དང་། བདུག་པ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་དང་། ཕེག་རྡོབ་པ་ཐོགས་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ལ་ཅི་རིགས་སུ་མཆོད་པ་བྱས་སོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: Then the nāga king Anavatapta, along with his sons, wives, relatives, and retinue, went to where the Blessed One was, bearing all kinds of flowers, powders, incense, ointments, fabrics, parasols, banners, flags, instruments, and drums, and on arrival he offered them as gifts to the Blessed One in the appropriate manner.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཆེན་པོ་དུ་མས་བསྐོར་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་འཁོར་གྱི་ཁྱམས་སུ་གཤེགས་སོ། །
en: Then the Blessed One, surrounded by many gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, bodhisattvas, and great hearers, proceeded to the abode of the nāga king Anavatapta.

source: གཤེགས་ནས་སེང་གེའི་ཁྲི་ཇི་ལྟར་བཤམས་པ་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་སོ། །འཁོར་ཐམས་ཅད་ཀྱང་ཁྲི་ལ་སོ་སོར་ཅི་རིགས་པར་འཁོད་དོ། །
en: There he sat down cross-legged upon the lion throne that had been set out and arranged for him, while all the members of his entourage also took their respective seats.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་བཅོམ་ལྡན་འདས་བཞུགས་པར་རིག་ནས་རང་གི་ལག་ནས་བཟའ་བ་དང་། བཅའ་བ་དང་། མྱོང་བ་མིའི་ལས་འདས་པ་ལྷའི་རོ་བྲོ་བ་ཅན་རོ་བརྒྱ་དང་ལྡན་པའི་ཞལ་ཟས་བཟང་པོ་མང་པོས་ཚིམ་པར་བསྟབས་སོ། །
en: Once he saw that the Blessed One was seated, the nāga king Anavatapta, with his own hands, served him food and drinks—many fine dishes beyond the realm of human experience, full of heavenly tastes and endowed with a hundred different flavors.

source: ཚིམ་པར་བསྟབས་ནས་ལྷུང་བཟེད་བཞག་སྟེ་ཕྱག་བཅབས་པར་རིག་ནས། བཅོམ་ལྡན་འདས་ལ་ཆོས་བཤད་པར་གསོལ་བ་བཏབ་བོ། །
en: Only when he saw that he had finished eating, had put away his alms bowl, and had washed his hands did he request the Blessed One to teach the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་ཆོས་བསྟན་པའི་ཕྱིར་བཞུགས་སོ། །
en: And so, that afternoon, after the Blessed One had risen from his rest, he sat down to teach the Dharma.

source: དེ་ནས་སའི་དཀྱིལ་འཁོར་ཀུན་ཏུ་དཔག་ཚད་སྟོང་ནས་བར་སྣང་གི་བར་དུ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དག་གིས་ཡོངས་སུ་གང་བར་གྱུར་ཏོ། །
en: At that time, the entire area, for a thousand leagues all around and up into the sky, was filled with gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans.
